<!-- コンポーネントの名前はパスカルケース 例：SectionTwo
（ケバブケースでも使えるが普通のHTMLのタグと区別し易い為、パスカルケースを使う）
コンポーネントの名前は２単語以上が推奨  -->

//[グローバル登録]　コンポーネントを都度インポートしなくても全ての場所で使用可能にする(よっぽど頻繁に使うもの以外はグローバル登録しない方がベター)
<!-- main.jsに以下を記述  -->
<!-- import BaseIcon from './BaseIcon.vue'  -->

<!-- app.component('BaseIcon', BaseIcon) -->
<!-- app.mount('#app')を呼び出す前にコンポーネントを記述する  -->
<!-- 各vueファイルでインポートしなくても、templateタグ内で<BaseIcon />の記述で呼び出すことができる -->

// import文の先頭を @ で表現することも可能。@ = src とvite.config.jsで定義されている
<!-- import Section3 from '@/components/Section3.vue' -->

// [コンポーネントタグに属性を付ける]
<!-- BaseButton.vue -->
<template>
  <div>
    <button>BaseButton</button>
  </div>
</template>

<!-- App.vue -->
<BaseButton id="base-button" />
<!-- コンポーネントが1つのタグに囲まれている場合(この場合はdiv)は、divタグにbase-buttonにid属性が付く -->
<!-- id、class、v-on属性はコンポーネントに継承される。 -->
<!-- コンポーネントの外側が複数のタグで構成されているものやタグに囲まれていない場合は、属性は継承されない。 -->

// 親コンポーネントで指定した属性を子コンポーネントで使う方法
<!-- 子コンポーネント側 -->
<h2 v-bind="$attrs">CountUp</h2>
<!-- id="base-button"の属性が付与される。複数の属性も継承可能。 -->

// [scoped属性] styleタグ内で定義したCSSに他のコンポーネントからアクセスできないようにする
<!-- <style scored>
.red {
  color: red;
}
</style> -->
<!-- 一つのコンポーネント内にscoped属性のついたstyleタグ(local)と付いてないstyleタグ(global)を記述することも可能 -->

// Viteを使ってグローバルなCSSを作る
<!-- ①assetフォルダ＞main.cssファイルを作成 -->
<!-- ②main.js内で上のファイルをインポートする(import '.assets/main.css') -->
<!-- ③main.css内にcssを記述する -->

// vueDevToolsの使い方
<!-- コンポーネントの確認  -->
<!-- A-①開発画面(localhost)の下部にある「V」マークのアイコンをクリックする
A-②左側にあるコンポーネンツのアイコンをクリック(iマークのすぐ下)
A-③左半分にあるコンポーネントを選択すると、右半分にそのコンポーネントの情報が表示される
上部中央あたりにある検索窓の右側のアイコンをクリックすると、画面上からコンポーネントを選択することができる
上部右側の「Open in editor」のアイコンをクリックすると、選択しているコンポーネントをエディター(VScode)で開く
もしくは
B-①開発画面(localhost)の下部にある「⚪︎」マークのアイコンをクリックする
B-②画面上からコンポーネントを選択
B-③選択したコンポーネントをエディターで開く -->

<!-- パフォーマンスの確認 -->
<!-- A-②タイムラインを開く
A-③PerfomanceをDisableにする
A-④上部の⚫︎をクリックし、レコーディングを開始する
A-⑤画面上のボタンを押したりした後に、レコーディングを止める
A-⑥パフォーマンスを確認することができる -->

<!-- コンポーネントの構造をグラフで描写することもできる -->
